-- 阳明心学核心
	心即理


	知行合一


	致良知



-- 人生自悟 



	做一事成一事


	谋事在人、成事在天


	AIGC

	读书

	书法-练字


	拍照 

	视频剪辑

-- sql优化
	     
	    mysql 索引 聚合索引不能中间不能断，带头大哥不能死，一般针对聚合索引  ，where 否则后面的索引失效
	    	  存储过程

	    hive


-- 布局

	一、每天布局

	1、每天坚持早睡早起。坚持6:00起床，22:30分左右睡觉。坚持每天唤醒你的不是闹钟，而是梦想。
	2、每天坚持看书二小时，没有时间也要挤出时间去看，随身携带一本书、坐公交、地铁的时候也可以看几页。读书，要多读一流的好书，站在巨人的肩膀上去看世界。
	3、每天日程坚持守时。凡事提前10分钟，重要会议提前二十分钟。写好当日计划，知行合一。
	4、每天坚持运动，顶置健康能力。每天摄入8粒红枣10粒枸杞，再来2～3公里慢跑或快走，保持身体活力四射。
	5、每天坚持出门前，面对镜子微笑。头发要姿整，皮鞋要油亮，腰杠要挺直，胡子不要走中间路线，人要有精神气。每天走路，走的是虎步。



	二、每周布局

	1、每周去一次图书馆，博览群书，提高思想和技能，最充分地去适应时代。
	2、每星期去见一个你想见的人，可以请比你优秀的人单独吃饭，也可以和志趣相投的人在一起，提升能量。
	3、每星期登山一次，会当凌绝顶 ，一览众山小。登山感悟自然，与生命对话，与命运和解。
	4、每周花半天时间，写一篇有深度的文章；或观看一部一流的记录片，再写一篇读后感。保持思想输出。
	5、每周和父母见一次面，家人闲坐，灯火可亲，就是握着一份稳稳的幸福。如果路途遥远，那么至少每星期给父母打一次电话，维持亲情，靠近亲情，因为人到了一定的年纪后，你就会发现，除了家人，你已几乎一无所有。



	三、每月布局


	1、每月存一次钱，哪怕是少少的500～1000元，也要坚持每月固定存钱，顶置储蓄能力。银行卡里的余额，才是你生活的底气。
	2、每月去做一件“无用”但开心的事。如到陌生的地方旅行，或参加马拉松比赛，“无用”即大用。
	3、每月考察调研一次，研究趋势，捕捉机会，发现商机。
	4、每月做一次义工，向他人付出爱，积福积徳。做人施比受有福。
	5、每月断舍离一次。不需要的东西，扔掉；负能量的朋友，扔掉。



	四，每年布局


	1、每年做一次战略布局。选择比努力重要，不要用战术上的勤奋去掩饰战略上的懒惰。
	2、每年自己体检一次，带家人体检一次。关注健康，听从营养医生的建议，调整生活方式和饮食习惯，养成更好更合适的生活规律。
	3、学会藏富。每年做一次稳健的投资，让财富产生裂变，增加睡后收入。
	4、每年出国一次，去感受不同的文化，去见识世界不同的面。
	5、每年回老家一次，寻根祭祖，饮水思源，回到故土，审视自己的灵魂，注入生命新的能力，不忘初心，重新出发。

-- 费曼学习法

	诺贝尔物理学奖获得者温伯格说：“学会一样东西很简单，一，去学习，二，去教会别人，三，去把心得写成一本书。”


	这就是费曼学习法的最佳实践
	谁是费曼
	今年有一部电影《奥本海默》，这位原子弹之父曾说：“费曼是原子弹项目中最杰出的年轻物理学家。”他是诺贝尔奖获得者，也是一位伟大的教育家。
	什么是费曼学习法
	简而言之，就是把你学的东西讲给别人听，以教的方式来学，你能讲清楚就是学会了，如果讲不清楚回到源头再去理解，然后再讲给别人听。

	 

	为什么说教学相长？
	因为，教就是最好的学。

	 

	一个人脱胎换骨的蜕变，都源于知识体系的升级。对于构建一门知识的体系结构，最有效的方法是分享，而分享最有效的形式是讲一堂课、带一个徒弟、写一本书……
	我坚持每天发一个短视频，通过输出的形式，梳理自己的知识体系，同时不断的输入，逼着自己去大量阅读和思考，把对知识的理解提升到一个新层次。对费曼学习法的持续践行，提升了我的语言表达和写作能力，职场自媒体全网有了百万粉丝（明哥聊求职/职场）。
	一位尚硅谷的老学员，工作时经常写文章发博客，在技术社区热心解答问题，后来，我鼓励他录一套视频教程，反响不错，出版社的编辑找到他出了一本书，现在他做了付费课程，还做了咨询顾问……既升华了自己的知识体系，又成功变现副业搞得风生水起。

	 

	费曼学习法的核心就是：
	用输入帮助输出，用输出倒逼输入。
	领导让你带新人，带不带？有的人不愿意带徒弟，因为没有激励，怕教会徒弟饿死师傅。其实，教会了徒弟最大的受益人是你，不是徒弟，也不是公司。

	 

	第一，带徒弟的过程中，沉淀下来教的方法是最大的价值。这是一次你对自己知识体系的梳理和完善。
	第二，如果师傅被饿死了，只能证明徒弟会不是师傅教的好。你的危机意识源于你对自己可以变得更好没有信心。
	一个人刚被提拔，面临的最大问题是：如何管理之前的同事？原来大家是一样的职位，同事尤其是和你资历差不多的同事永远会问一句话：凭什么是你？这是一个管理者刚晋升时的最大挑战。
	所以，提拔之前，你的主管可能会安排两件事：一是把重要的事交给你做，二就是把新人交给你带。

	 

	一，能承担责任的人才能当领导

	提拔一个人最合适的理由是：他承担了责任，解决了问题，创造了价值，展现出了他的领导力。把重要的事交给你做，有了责任就有了权力，责权利是三位一体的，提拔就顺理成章。
	二，能培养新人的人才能当领导

	新员工交给你来带，一是培养你带人的能力，二是部门里的张三、李四、王二麻子都是你带出来的，你就有了自己的队伍，而群众的选择才是真正的选择。
	这两件事都干完了，把你提拔上来大家都服。带徒弟，是你一次绝佳的学习和成长的机会，通过教的形式，可以把自己的知识体系提升到一个新境界。

-- 离线数仓 
	数据建模

	hive
		优化
		原理
		基本语法
	
	数据迁移 
	      sqoop 
	      datax
	      canal
	      maxwell
	      dbsyncer 关系型数据库 mysql 可以基于binlog 增量读取，全量读取	

	调度工具
		   dolphinscheduler


-- 实时数仓 
	流计算
	存算分离
		   flink  计算 
           doris 存储
           clickhouse 
           seatunnel





